app/Http/Controllers/SearchController.php

    function search(Request $request){
        $q = $request->get('q');

        $images_name = Image::with('user')
            ->where('image_title','LIKE','%'.$q.'%')
            ->get();
---
select * from `images` where `image_title` LIKE '%%'